# Екземпляр запису. Відповідає за зберігання усіх змінних (або екземплярів класів зі змінними, тут вже як забажаєте). Викликається (створюється) у InputManager, та зберігається у
# ContactBook лише за умови повного заповнення усіх полів. Необов'язкові поля можуть бути пропущені символом "-". Не зберігається за умови виклику функції, що скасовує запис.
# У самому класі зберігається лише функціонал запису/зміни/видалення/тощо. 
# Викликаються відповідні методи з InputManager'а, який попередньо створює "діалог" з користувачем та збирає усі необхідні аргументи.
class RecordManager():
    def __init__(self, name='', birthday=None):
        self.command_dict = {}
        self.phones = [] # В домашніх завданнях тут мали бути екземпляри класів, але такий формат збереження, як на мене, і надмірно ускладнений, і не зручний. Тому, як на мене, краще зберігати саме строку з номером.
        self.name = name
        self.birthday = birthday # або екземпляр класу (бо в нас же має бути належна перевірка правильності заданої дати)
        pass