# Екземпляр запису. Відповідає за зберігання усіх змінних (або екземплярів класів зі змінними, тут вже як забажаєте). Викликається (створюється) у InputManager, та зберігається у
# ContactBook лише за умови повного заповнення усіх полів. Необов'язкові поля можуть бути пропущені символом "-". Не зберігається за умови виклику функції, що скасовує запис.
# У самому класі зберігається лише функціонал запису/зміни/видалення/тощо. 
# Викликаються відповідні методи з InputManager'а, який попередньо створює "діалог" з користувачем та збирає усі необхідні аргументи.
class RecordManager:
    pass